HOST_URL = 'http://test.com/'

VIEW_URL = f"{HOST_URL}checks/{{check_id}}/view"

ENV_VARS = {
    'HOST_URL': HOST_URL,
    'HOST_PORT': '80',
    'DATABASE_HOST': '127.0.0.1',
    'DATABASE_PORT': '5667',
    'DATABASE_NAME': 'checkbox',
    'DATABASE_USER': 'postgres',
    'DATABASE_PASSWORD': '',
    'AUTH_SECRET_KEY': '81a2b001e62a2f073677f17c63ae3da45687750afa4836f071008e371c9281d3'
}


STANDART_CHECK = f"""\
      ФОП Джонсонюк Борис
================================
1.337 x 7.77
Олія соняшникова нерафінована
холодного віджиму          10.39
--------------------------------
0.999 x 42.42
Органічне борошно пшеничне
вищого ґатунку             42.38
================================
СУМА                       52.77
Готівка                   100.00
Решта                      47.23
================================
        {{created_at}}
      Дякуємо за покупку!"""


CHECK_20_WIDTH = f"""\
ФОП Джонсонюк Борис
====================
1.337 x 7.77
Олія соняшникова
нерафінована
холодного віджиму
               10.39
--------------------
0.999 x 42.42
Органічне борошно
пшеничне вищого
ґатунку        42.38
====================
СУМА           52.77
Готівка       100.00
Решта          47.23
====================
  {{created_at}}
Дякуємо за покупку!"""


CHECK_80_WIDTH = f"""\
                              ФОП Джонсонюк Борис
================================================================================
1.337 x 7.77
Олія соняшникова нерафінована холодного віджиму                            10.39
--------------------------------------------------------------------------------
0.999 x 42.42
Органічне борошно пшеничне вищого ґатунку                                  42.38
================================================================================
СУМА                                                                       52.77
Готівка                                                                   100.00
Решта                                                                      47.23
================================================================================
                                {{created_at}}
                              Дякуємо за покупку!"""
